#### Terraform Plan Summary: ⚠️ Changes

Plan: 47 to add, 22 to change, 32 to destroy.

<details><summary>Show Redacted Plan</summary>

```hcl
[command]/home/runner/work/_temp/721dca21-3f75-46a7-a2f3-657f313ddae6/terraform-bin show -no-color tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.acm.aws_acm_certificate.this[0] has changed
  ~ resource "aws_acm_certificate" "this" {
        id                        = "arn:aws:acm:us-east-1:590184049425:certificate/a7e1eba7-2cc9-4c6f-86b5-c93fa6e5b885"
      + not_after                 = "2026-01-27T23:59:59Z"
      + not_before                = "2024-12-29T00:00:00Z"
      ~ renewal_eligibility       = "INELIGIBLE" -> "ELIGIBLE"
      ~ status                    = "PENDING_VALIDATION" -> "ISSUED"
        tags                      = {
            "Name" = "shodapp.seansalmassi.com"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] has changed
  ~ resource "aws_eks_access_policy_association" "this" {
        id            = "shodapp-cluster#arn:aws:iam::590184049425:user/cloud_user#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
        # (5 unchanged attributes hidden)

      ~ access_scope {
          + namespaces = []
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0c46c0e5680924ed9"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0dc7dcbdb1156c4e1"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "shodapp-eks-vpc"
        }
        # (5 unchanged attributes hidden)
    }

  # module.eks.module.eks_managed_node_group["shodan-k8s"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "shodapp-cluster:shodan-k8s-20241229124410335600000013"
      + labels                 = {}
        tags                   = {
            "Environment" = "dev"
            "Name"        = "shodan-k8s"
            "Terraform"   = "true"
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "cluster" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + compute_config            = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "shodapp-cluster"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + remote_network_config     = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + storage_config            = (known after apply)
      + tags                      = (known after apply)
      + upgrade_policy            = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
      + zonal_shift_config        = (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "cluster" {
      + id    = (known after apply)
      + name  = "shodapp-cluster"
      + token = (sensitive value)
    }

  # aws_acm_certificate_validation.cert must be replaced
-/+ resource "aws_acm_certificate_validation" "cert" {
      ~ id                      = "2024-12-29 12:34:21.59 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_339de3ded615c6647cc5695bb8976d71.shodapp.seansalmassi.com",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route53_record.acm_validation["shodapp.seansalmassi.com"] must be replaced
-/+ resource "aws_route53_record" "acm_validation" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "_339de3ded615c6647cc5695bb8976d71.shodapp.seansalmassi.com" -> (known after apply)
      ~ id                               = "Z00891131OSP4IF3CZM29__339de3ded615c6647cc5695bb8976d71.shodapp.seansalmassi.com._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_339de3ded615c6647cc5695bb8976d71.shodapp.seansalmassi.com"
      ~ zone_id                          = <<-EOT # forces replacement
            Z00891131OSP4IF3CZM29
        EOT
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.argocd must be replaced
-/+ resource "aws_route53_record" "argocd" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "argocd.shodapp.seansalmassi.com" -> (known after apply)
      ~ id                               = "Z00891131OSP4IF3CZM29_argocd.shodapp.seansalmassi.com_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "argocd.shodapp.seansalmassi.com"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = <<-EOT # forces replacement
            Z00891131OSP4IF3CZM29
        EOT
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.seansalmassi-com must be replaced
-/+ resource "aws_route53_record" "seansalmassi-com" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "shodapp.seansalmassi.com" -> (known after apply)
      ~ id                               = "Z00891131OSP4IF3CZM29_shodapp.seansalmassi.com_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "shodapp.seansalmassi.com"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = <<-EOT # forces replacement
            Z00891131OSP4IF3CZM29
        EOT
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_security_group.Allow_services will be updated in-place
  ~ resource "aws_security_group" "Allow_services" {
        id                     = "sg-0fe32ffac0dade6b2"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "elbv2.k8s.aws/targetGroupBinding=shared"
              - from_port        = 3000
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-010148e6863d1837f",
                ]
              - self             = false
              - to_port          = 8080
            },
            # (3 unchanged elements hidden)
        ]
        name                   = "PROD"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # null_resource.argocd_application will be destroyed
  # (because null_resource.argocd_application is not in configuration)
  - resource "null_resource" "argocd_application" {
      - id       = "6252092173628134658" -> null
      - triggers = {
          - "argocd_deployment"    = "argocd"
          - "cluster_name"         = "shodapp-cluster"
          - "kubernetes_namespace" = "argocd"
        } -> null
    }

  # time_sleep.wait_for_argocd will be destroyed
  # (because time_sleep.wait_for_argocd is not in configuration)
  - resource "time_sleep" "wait_for_argocd" {
      - create_duration = "90s" -> null
      - id              = "2024-12-29T12:50:50Z" -> null
    }

  # time_sleep.wait_for_eks will be destroyed
  # (because time_sleep.wait_for_eks is not in configuration)
  - resource "time_sleep" "wait_for_eks" {
      - create_duration = "30s" -> null
      - id              = "2024-12-29T12:47:27Z" -> null
    }

Plan: 4 to add, 1 to change, 7 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.acm.aws_acm_certificate.this[0] has changed%0A  ~ resource "aws_acm_certificate" "this" {%0A        id                        = "arn:aws:acm:us-east-1:590184049425:certificate/a7e1eba7-2cc9-4c6f-86b5-c93fa6e5b885"%0A      + not_after                 = "2026-01-27T23:59:59Z"%0A      + not_before                = "2024-12-29T00:00:00Z"%0A      ~ renewal_eligibility       = "INELIGIBLE" -> "ELIGIBLE"%0A      ~ status                    = "PENDING_VALIDATION" -> "ISSUED"%0A        tags                      = {%0A            "Name" = "shodapp.seansalmassi.com"%0A        }%0A        # (11 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] has changed%0A  ~ resource "aws_eks_access_policy_association" "this" {%0A        id            = "shodapp-cluster#arn:aws:iam::590184049425:user/cloud_user#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"%0A        # (5 unchanged attributes hidden)%0A%0A      ~ access_scope {%0A          + namespaces = []%0A            # (1 unchanged attribute hidden)%0A        }%0A    }%0A%0A  # module.vpc.aws_route_table.public[0] has changed%0A  ~ resource "aws_route_table" "public" {%0A        id               = "rtb-0c46c0e5680924ed9"%0A      ~ route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = "igw-0dc7dcbdb1156c4e1"%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = ""%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A        tags             = {%0A            "Name" = "shodapp-eks-vpc"%0A        }%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.eks.module.eks_managed_node_group["shodan-k8s"].aws_eks_node_group.this[0] has changed%0A  ~ resource "aws_eks_node_group" "this" {%0A        id                     = "shodapp-cluster:shodan-k8s-20241229124410335600000013"%0A      + labels                 = {}%0A        tags                   = {%0A            "Environment" = "dev"%0A            "Name"        = "shodan-k8s"%0A            "Terraform"   = "true"%0A        }%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A  - destroy%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # data.aws_eks_cluster.cluster will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_eks_cluster" "cluster" {%0A      + access_config             = (known after apply)%0A      + arn                       = (known after apply)%0A      + certificate_authority     = (known after apply)%0A      + cluster_id                = (known after apply)%0A      + compute_config            = (known after apply)%0A      + created_at                = (known after apply)%0A      + enabled_cluster_log_types = (known after apply)%0A      + endpoint                  = (known after apply)%0A      + id                        = (known after apply)%0A      + identity                  = (known after apply)%0A      + kubernetes_network_config = (known after apply)%0A      + name                      = "shodapp-cluster"%0A      + outpost_config            = (known after apply)%0A      + platform_version          = (known after apply)%0A      + remote_network_config     = (known after apply)%0A      + role_arn                  = (known after apply)%0A      + status                    = (known after apply)%0A      + storage_config            = (known after apply)%0A      + tags                      = (known after apply)%0A      + upgrade_policy            = (known after apply)%0A      + version                   = (known after apply)%0A      + vpc_config                = (known after apply)%0A      + zonal_shift_config        = (known after apply)%0A    }%0A%0A  # data.aws_eks_cluster_auth.cluster will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_eks_cluster_auth" "cluster" {%0A      + id    = (known after apply)%0A      + name  = "shodapp-cluster"%0A      + token = (sensitive value)%0A    }%0A%0A  # aws_acm_certificate_validation.cert must be replaced%0A-/+ resource "aws_acm_certificate_validation" "cert" {%0A      ~ id                      = "2024-12-29 12:34:21.59 +0000 UTC" -> (known after apply)%0A      ~ validation_record_fqdns = [%0A          - "_339de3ded615c6647cc5695bb8976d71.shodapp.seansalmassi.com",%0A        ] -> (known after apply) # forces replacement%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # aws_route53_record.acm_validation["shodapp.seansalmassi.com"] must be replaced%0A-/+ resource "aws_route53_record" "acm_validation" {%0A      + allow_overwrite                  = (known after apply)%0A      ~ fqdn                             = "_339de3ded615c6647cc5695bb8976d71.shodapp.seansalmassi.com" -> (known after apply)%0A      ~ id                               = "Z00891131OSP4IF3CZM29__339de3ded615c6647cc5695bb8976d71.shodapp.seansalmassi.com._CNAME" -> (known after apply)%0A      - multivalue_answer_routing_policy = false -> null%0A        name                             = "_339de3ded615c6647cc5695bb8976d71.shodapp.seansalmassi.com"%0A      ~ zone = <redacted> -> null%0A    }%0A%0APlan: 4 to add, 1 to change, 7 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```
</details>

*Pushed by: @batzsalmassi, Action: `pull_request`*